//标题:iNOC产品部 - 杨辉三角的变形
//	1
//	1 1 1
//	1 2 3 2 1
//	1 3 6 7 6 3 1
//	1 4 10 16 19 16 10 4 1
//	以上三角形的数阵，第一行只有一个数1，以下每行的每个数，是恰好是它上面的数，左上角数到右上角的 数，3个数之和(如果不存在某个数，认为该数就是0)。
//	求第n行第一个偶数出现的位置。如果没有偶数，则输出 - 1。例如输入3, 则输出2，输入4则输出3。
//	输入n(n <= 1000000000)
//输入描述: 输入一个int整数
//  输出描述 : 输出返回的int值
//	 示例1 :
//   输入 4
//	   输出 3
//
//
//
//
//
//   标题:超长正整数相加
//	 请设计一个算法完成两个超长正整数的加法。
//	  接口说明
//	  /*
//	  请设计一个算法完成两个超长正整数的加法。 输入参数:
//	  String addend:加数
//	  String augend:被加数
//	  返回值:加法结果
//	  */
//	  public String AddLongInteger(String addend, String augend) {
//		  /*在这里实现功能*/
//		  return null;
//	  }
//输入描述:
//   输入两个字符串数字
//   输出描述 : 输出相加后的结果，string型
//	  示例1 :
//   输入 99999999999999999999999999999999999999999999999999 1
//	   输出
//	   100000000000000000000000000000000000000000000000000