//标题:查找输入整数二进制中1的个数
//	请实现如下接口
//	public
//	static
//	int
//	findNumberOf1(
//	int
//	num)
//{
//		/*
//		请实现
//		*/
//		return
//			0;
//	}
//譬如:输入5 ，5的二进制为101，输出2
//涉及知识点 :
//输入描述 : 输入一个整数
//输出描述 : 计算整数二进制中1的个数
//   示例1 : 输入 5
//		 输出
//		 2
//
//
//	 标题 : 手套
//		  在地下室里放着n种颜色的手套，手套分左右手，但是每种颜色的左右手手套个数不一定相同。A先生现在要 出门，所以他要去地下室选手套。但是昏暗的灯光让他无法分辨手套的颜色，只能分辨出左右手。所以他会 多拿一些手套，然后选出一双颜色相同的左右手手套。现在的问题是，他至少要拿多少只手套(左手加右手)， 才能保证一定能选出一双颜色相同的手套。
//		  给定颜色种数n(1≤n≤13), 同时给定两个长度为n的数组left, right, 分别代表每种颜色左右手手套的数量。数据保 证左右的手套总数均不超过26，且一定存在至少一种合法方案。
//	  测试样例 :
//	   4, [0, 7, 1, 6], [1, 5, 0, 6]
//	   返回 : 10(解释 : 可以左手手套取2只，右手手套取8只)