//标题:字符串中找出连续最长的数字串
//	读入一个字符串str，输出字符串str中的连续最长的数字串
//输入描述 :
//一个测试输入包含1个测试用例，一个字符串str，长度不超过255。
//输出描述 : 
//在一行内输出str中里连续最长的数字串。 
//示例1 :
//输入
//	abcd12345ed125ss123456789
//输出
//	123456789








//标题 : 数组中出现次数超过一半的数字
//数组中有一个数字出现的次数超过数组长度的一半，请找出这个数字。
//例如输入一个长度为9的数组{ 1, 2, 3, 2, 2, 2, 5, 4, 2 }。
//由于数字2在数组中出现了5次，超过数组长度的一半，因此输出2。如果不存在则输出 0。



#include <iostream>
using namespace std;

int main() {
	//char a[10] = { '1','2','3','4','5','6','7','8','9',0 }, * p; 
//	int a[][3] = { {1,0,1}, { }, {1,1} };
	int a[][2] = { {}, { }, {} };
	cout << a[1][0];
	return 0;
}